Revit 2027 API
BuiltInFailures.ViewFailures.ZeroLengthViewRegionsRemoved Property
 Some View Regions were removed. When the size of a View Region becomes zero, it is removed from the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ZeroLengthViewRegionsRemoved { get; }
Public Shared ReadOnly Property ZeroLengthViewRegionsRemoved As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ZeroLengthViewRegionsRemoved {
	FailureDefinitionId^ get ();
}
static member ZeroLengthViewRegionsRemoved : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ViewFailures Class
Autodesk.Revit.DB Namespace